import React from 'react';
import {StyleSheet, Text, View, ScrollView, Image} from 'react-native';

export default function AboutUs() {
  return (
    <ScrollView style={styles.aboutUsContainer}>
      <View style={styles.aboutUs}>
        <Image style={styles.logo} source={require('../assets/001.png')} />
        <Text style={styles.aboutUsPara}>
          חברת פטרון לייזר היא חברה מובילה בתחום הייצור, ייבוא ושיווק מכשור
          טכנולוגי חדשני ומתקדם בעולם האסתטיקה בישראל. החברה הוקמה בשנת 2009, על
          ידי ארז מלכה ואבי גבסו, והפכה במרוצת השנים למותג מוביל בתחום המכשור
          הטכנולוגי בענף הרפואה, האסתטיקה והיופי. מאז ועד היום החברה התחילה את
          דרכה בתחום המכשור הטכנולוגי, והוקמה על בסיס החזון: "לייצר ולפתח מכשור
          טכנולוגי המבוסס על הטכנולוגיה החדשנית והמתקדמת ביותר בעולם". המכשור
          הטכנולוגי של פטרון לייזר בעל תו תקן מחמיר הכולל בקרת איכות כחול לבן,
          שמסייעת בהבנת הצורך של לקוח הקצה ומתן פתרונות טכנולוגיים בהתאמה אישית.
          פטרון לייזר צברה ניסיון עשיר, מקצוענות ומוניטין גבוה בתחום המכשור
          הטכנולוגי. עד שנת 2018, החברה שיווקה מכשור טכנולוגי לשוק המוסדי
          ולחברות משווקות. בשנת 2018, החליטה החברה לשווק את המכשור הטכנולוגי
          שברשותה, גם בפלטפורמת שיווק ישיר למכוני יופי, קוסמטיקה, רשתות טיפוח
          ויופי, מכוני כושר וקליניקות פרטיות. כיום, ניתן למצוא את המכשור
          הטכנולוגי של חברת פטרון לייזר ברוב מכוני היופי והאסתטיקה ברחבי הארץ.
          המכשור החדשני והמתקדם משמש לצורך מגוון רחב של טיפולים אסתטיים ורפואיים
          כגון: טיפולי פנים, טיפולי שיניים, הסרת שיער, הסרת קעקועים, חיטוב הגוף,
          שיזוף ביתי, טיפולי אנטי אייג'ינג ועוד. פטרון לייזר: חדשנות, מקצוענות,
          מצוינות ואיכות חסרת פשרות! חברת פטרון לייזר, חרטה על דגלה ערכים של
          חדשנות, מקצוענות, אמינות, מצוינות, איכות גבוהה וחסרת פשרות, שירות
          אדיב, יחס אישי, אוזן קשבת, שביעות רצון הלקוח, ליווי 360 ואהבה גדולה
          לעולם היופי והאסתטיקה. ליווי 360 חוויות הלקוח חשובה לנו, לאין שיעור,
          ואנו מעניקים ליווי 360 ללקוחותינו לאורך כל הדרך – החל משלב הייעוץ
          הראשוני, דרך ההדרכה הטכנית ועד לתגובות של לקוחות הקצה, כל זאת במטרה
          להעניק מעטפת שלמה ללקוחותינו
        </Text>
        <Text style={styles.aboutUsFooter1}>Patron Devs</Text>
        <Text style={styles.aboutUsFooter}>&copy;2023</Text>
      </View>
    </ScrollView>
  );
}

const styles = StyleSheet.create({
  text: {
    color: '#000',
  },

  logo: {
    width: 200,
    height: 100,
    resizeMode: 'contain',
    tintColor: '#fff',
  },
  aboutUsContainer: {
    flex: 1,
    backgroundColor: '#131035',
    paddingVertical: 20,
  },
  aboutUs: {
    height: 'auto',
  },
  aboutUsPara: {
    fontSize: 14,
    marginTop: 20,
    left: 40,
    width: 350,
  },
  aboutUsFooter: {
    textAlign: 'center',
  },
  aboutUsFooter1: {
    marginTop: 300,
    textAlign: 'center',
  },
});
